Vulnerability_Test_Results/artillery-load-test.yml
config:
  target: "http://localhost:8000/api/v1"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Ramp up phase
    - duration: 40
      arrivalRate: 10
      name: Sustained load phase
    - duration: 10
      arrivalRate: 1
      name: Cool down phase
scenarios:
  - flow:
      - get:
          url: "/categories/"
      - get:
          url: "/items/"
